package scopeFunction
// 参考 https://juejin.im/post/5a1be4cc51882512a86108f8
/***
 * 作用域函数测试
 */
fun main(args: Array<String>) {
    println("=====================with======================")
    WithTest().test()
    println("=====================with======================")

    println("=====================also======================")
    AlsoTest().test()
    println("=====================also======================")

    println("=====================run======================")
    RunTest().test()
    println("=====================run======================")

    println("=====================apply======================")
    ApplyTest().test()
    println("=====================apply======================")

    println("=====================let======================")
    LetTest().test()
    println("=====================let======================")
}

